<template>
<div>
    <ProjectListItem 
    v-for="item in projects" :key="item.code"
    v-bind:project="item"
    />
    <PlugVue  
        v-if="projects.length === 0"
        :plagText="'Не создан ни один проект'"
    />
</div>
</template>

<script>
import ProjectListItem from '@/components/ProjectListItem/ProjectListItem.vue'
import PlugVue from '@/components/PlugVue/PlugVue.vue'

export default {
  name: "ProjectsPage",

  components: {
    ProjectListItem,
    PlugVue
  },

  data() {
    return {
        projects: [
            {
                name: 'Название проекта 1',
                code: "2323",
                user: 'Иванов И.И. создал(а) 1 час назад',
                admin: 'Баранов В.В. изменил(а) 1 минуту назад'
            },
             {
                name: 'Название проекта 2',
                code: "232121",
                user: 'Сазонов И.И. создал(а) 1 час назад',
                admin: 'Бар В.В. изменил(а) 1 минуту назад'
            },
             {
                name: 'Название проекта 3',
                code: "6666623",
                user: 'Ким И.И. создал(а) 1 час назад',
                admin: 'Конев В.В. изменил(а) 1 минуту назад'
            },
             {
                name: 'Название проекта 4 Название проекта 4 Название проекта 4 Название проекта 4 Название проекта 4 Название проекта 4 Название проекта 4 Название проекта 4 Название проекта 4 Название проекта 4 Название проекта 4 Название проекта 4 Название проекта 4 Название проекта 4Название проекта 4 Название проекта 4Название проекта 4Название проекта 4Название проекта 4Название проекта 4 Название проекта 4 Название проекта 4Название проекта 4Название проекта 4Название проекта 4 v',
                code: "78723",
                user: 'Иванченко И.И. создал(а) 1 час назад',
                admin: 'Боб В.В. изменил(а) 1 минуту назад'
            },
             {
                name: 'Название проекта 5',
                code: "23523346436464646456464564564564564564564565323",
                user: 'Петоров И.И. создал(а) 1 час назад',
                admin: 'Митяев В.В. изменил(а) 1 минуту назад'
            },
        ]
    }
  }
}
</script>
