<template>
   <div>
    <TaskListItem
        v-for="item in tasks" 
        :key="item.code"
        :task="item"
    />
    <PlugVue  
        v-if="tasks.length === 0"
        :plugText="'Не создана ни одина задача'"
    />
   </div>
</template>

<script>
import TaskListItem from '@/components/TaskListItem/TaskListItem.vue'
import PlugVue from '@/components/PlugVue/PlugVue.vue'

export default {
    name: "TasksPage",

    components: {
        TaskListItem,
        PlugVue
    },

    data() {
        return {
            tasks: [
                {
                name: 'Название задачи 1 Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1Название задачи 1',
                code: "15423",
                status: 'DRAFT',
                user: 'Иванов И.И. создал(а) 1 час назад',
                admin: 'Баранов В.В. изменил(а) 1 минуту назад'
                },
                {
                name: 'Название задачи 2',
                code: "345345345345345345345345345345345345345343545345",
                status: 'IN_PROCESS',
                user: 'Сазонов И.И. создал(а) 1 час назад',
                admin: 'Бар В.В. изменил(а) 1 минуту назад'
                },
                {
                name: 'Название задачи 3',
                code: "6777666623",
                status: 'COMPLETED',
                user: 'Ким И.И. создал(а) 1 час назад',
                admin: 'Конев В.В. изменил(а) 1 минуту назад'
                },
                {
                name: 'Название задачи 4',
                code: "786767723",
                status: 'TESTING',
                user: 'Иванченко И.И. создал(а) 1 час назад',
                admin: 'Боб В.В. изменил(а) 1 минуту назад'
                },
                {
                name: 'Название задачи 5',
                code: "235888235323",
                status: 'CLOSED',
                user: 'Петоров И.И. создал(а) 1 час назад',
                admin: 'Митяев В.В. изменил(а) 1 минуту назад'
                }
            ]
        }
    }
}
</script>
